In [1]:
import pandas as pd
from sqlalchemy.engine import create_engine

In [2]:
engine = create_engine('postgresql://postgres:DSpark2019@127.0.0.1:5432/postgres')

In [3]:
sql = """
        Select table_name, table_schema
        FROM information_schema.tables
        WHERE table_schema = 'public'
        ORDER BY table_name
      """

pd.read_sql(sql, engine)

       table_name table_schema
0          cities       public
1       countries       public
2  countries_plus       public
3      currencies       public
4       economies       public
5   economies2010       public
6   economies2015       public
7       languages       public
8     populations       public

In [6]:
sql = """
        SELECT * 
        FROM cities
        LIMIT 5;
      """

pd.read_sql(sql, engine)

          name country_code  city_proper_pop  metroarea_pop  urbanarea_pop
0      Abidjan          CIV        4765000.0            NaN      4765000.0
1    Abu Dhabi          ARE        1145000.0            NaN      1145000.0
2        Abuja          NGA        1235880.0      6000000.0      1235880.0
3        Accra          GHA        2070463.0      4010054.0      2070463.0
4  Addis Ababa          ETH        3103673.0      4567857.0      3103673.0

In [7]:
sql = """
        SELECT * 
        FROM countries
        LIMIT 5;
      """
pd.read_sql(sql, engine)

,code,name,continent,region,surface_area,indep_year,local_name,gov_form,capital,cap_long,cap_lat
0,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,Afganistan/Afqanestan,Islamic Emirate,Kabul,69.17610,34.5228
1,NLD,Netherlands,Europe,Western Europe,41526.0,1581.0,Nederland,Constitutional Monarchy,Amsterdam,4.89095,52.3738
2,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,Shqiperia,Republic,Tirane,19.81720,41.3317
3,DZA,Algeria,Africa,Northern Africa,2381740.0,1962.0,Al-Jazair/Algerie,Republic,Algiers,3.05097,36.7397
4,ASM,American Samoa,Oceania,Polynesia,199.0,NaN,Amerika Samoa,US Territory,Pago Pago,-170.69100,-14.2846

In [9]:
sql = """
            -- 1. Select name fields (with alias) and region
        SELECT countries.name as country, cities.name as cities, countries.region as region
        FROM cities
            -- 2. Inner join to countries
        INNER JOIN countries
            -- 3. Match on the country codes
        ON cities.country_code = countries.code;
      """

pd.read_sql(sql,engine).head()

                country       cities          region
0         Cote d'Ivoire      Abidjan  Western Africa
1  United Arab Emirates    Abu Dhabi     Middle East
2               Nigeria        Abuja  Western Africa
3                 Ghana        Accra  Western Africa
4              Ethiopia  Addis Ababa  Eastern Africa